InfII.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-10 So 21:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Note of Information II</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="sx" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">The Note of Information II</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd89b46d">Functional Programm of Haskell</a>
<ul>
<li><a href="#org920bc61">Grundlage</a></li>
<li><a href="#org7778d6b">Pattern Matching</a></li>
<li><a href="#org61110be">Alternativen</a></li>
<li><a href="#org4621904">Recursion</a></li>
<li><a href="#org932d886">type conversion</a></li>
<li><a href="#org62e0822">Factorial</a></li>
<li><a href="#org379c850">Stern Brocot Floge</a></li>
</ul>
</li>
<li><a href="#orgc2b2ce4">Schaltnetze</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd89b46d" class="outline-2">
<h2 id="orgd89b46d">Functional Programm of Haskell</h2>
<div class="outline-text-2" id="text-orgd89b46d">
</div>
<div id="outline-container-org920bc61" class="outline-3">
<h3 id="org920bc61">Grundlage</h3>
<div class="outline-text-3" id="text-org920bc61">
<p>
basic function call
</p>
<div class="org-src-container">
<pre class="src src-haskell">  log2 <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Float</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Float</span>
  log2 <span style="color: #9acd32;">=</span> logBase 2
<span style="color: #00ff7f;">log2</span> 43

</pre>
</div>

<p>
implication
</p>
<div class="org-src-container">
<pre class="src src-haskell">
  (<span style="color: #9acd32;">==&gt;</span>)<span style="color: #9acd32;">::</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span>
  a <span style="color: #9acd32;">==&gt;</span> b <span style="color: #9acd32;">=</span> not a <span style="color: #9acd32;">||</span> not b
<span style="color: #9370db;">Flase</span> <span style="color: #00ff7f;">==&gt;</span> <span style="color: #9370db;">True</span>
<span style="color: #9370db;">False</span><span style="color: #00ff7f;">==&gt;</span> <span style="color: #9370db;">False</span>
<span style="color: #9370db;">True</span> <span style="color: #00ff7f;">==&gt;</span> <span style="color: #9370db;">True</span>

</pre>
</div>

<p>
&#x2013;euler numbers
</p>
<div class="org-src-container">
<pre class="src src-haskell">
  e<span style="color: #9acd32;">::</span> <span style="color: #9370db;">Float</span>
    e <span style="color: #9acd32;">=</span> exp 1
e 
</pre>
</div>
</div>
</div>

<div id="outline-container-org7778d6b" class="outline-3">
<h3 id="org7778d6b">Pattern Matching</h3>
<div class="outline-text-3" id="text-org7778d6b">
<p>
one of the calling must match one case of pattern
</p>
<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #00ff7f;">&lt;#&gt;</span>) <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span>
  (<span style="color: #9acd32;">&lt;#&gt;</span>) <span style="color: #9370db;">False</span> <span style="color: #9370db;">False</span> <span style="color: #9acd32;">=</span> <span style="color: #9370db;">False</span>
  (<span style="color: #9acd32;">&lt;#&gt;</span>) <span style="color: #9370db;">False</span> <span style="color: #9370db;">True</span> <span style="color: #9acd32;">=</span> <span style="color: #9370db;">True</span>
  (<span style="color: #9acd32;">&lt;#&gt;</span>) <span style="color: #9370db;">True</span> <span style="color: #9370db;">False</span> <span style="color: #9acd32;">=</span> <span style="color: #9370db;">True</span>
  (<span style="color: #9acd32;">&lt;#&gt;</span>) <span style="color: #9370db;">True</span> <span style="color: #9370db;">True</span> <span style="color: #9acd32;">=</span> <span style="color: #9370db;">True</span>


<span style="color: #9370db;">True</span> <span style="color: #00ff7f;">&lt;#&gt;</span> <span style="color: #9370db;">True</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-haskell">
(<span style="color: #00ff7f;">&lt;#&gt;</span>) <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span>
  (<span style="color: #9acd32;">&lt;#&gt;</span>) <span style="color: #9370db;">True</span> <span style="color: #9370db;">True</span> <span style="color: #9acd32;">=</span> <span style="color: #9370db;">True</span>
  (<span style="color: #9acd32;">&lt;#&gt;</span>) <span style="color: #20b2aa; font-weight: bold;">_</span> <span style="color: #20b2aa; font-weight: bold;">_</span> <span style="color: #9acd32;">=</span> <span style="color: #9370db;">False</span>

(<span style="color: #00ff7f;">&lt;#&gt;</span>) <span style="color: #9370db;">True</span> <span style="color: #9370db;">True</span>
(<span style="color: #00ff7f;">&lt;#&gt;</span>) <span style="color: #9370db;">False</span> <span style="color: #9370db;">True</span>

</pre>
</div>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #00ff7f;">&lt;#&gt;</span>) <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span>
  (<span style="color: #9acd32;">&lt;#&gt;</span>) <span style="color: #9370db;">True</span> <span style="color: #9370db;">True</span> <span style="color: #9acd32;">=</span> <span style="color: #9370db;">True</span>

</pre>
</div>

<p>
case : this can only be executed in a .hs file,
 in orgmode can NOT be imported, I don't know what is going on
 in Terminal can NOT also
</p>

<p>
Here I made above mistake, this is no sense.
so long the indentation is correct, so works
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #00ff7f;">&lt;#&gt;</span>) <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span>
(<span style="color: #00ff7f;">&lt;#&gt;</span>) a b
  <span style="color: #9acd32;">|</span> a <span style="color: #9acd32;">==</span> b <span style="color: #9acd32;">=</span> <span style="color: #9370db;">False</span>
  <span style="color: #9acd32;">|</span> otherwise <span style="color: #9acd32;">=</span> <span style="color: #9370db;">True</span>


</pre>
</div>
</div>
</div>

<div id="outline-container-org61110be" class="outline-3">
<h3 id="org61110be">Alternativen</h3>
<div class="outline-text-3" id="text-org61110be">
<p>
if else then
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #00ff7f;">absolute</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Int</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Int</span>
<span style="color: #00ff7f;">absolute</span> x <span style="color: #9acd32;">=</span> <span style="color: #20b2aa; font-weight: bold;">if</span> x <span style="color: #9acd32;">&lt;</span> 0 <span style="color: #20b2aa; font-weight: bold;">then</span> <span style="color: #9acd32;">-</span>x <span style="color: #20b2aa; font-weight: bold;">else</span> x

</pre>
</div>
</div>
</div>

<div id="outline-container-org4621904" class="outline-3">
<h3 id="org4621904">Recursion</h3>
<div class="outline-text-3" id="text-org4621904">
<p>
easy fib
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #00ff7f;">heronA</span> <span style="color: #9acd32;">::</span>(<span style="color: #9370db;">Int</span>, <span style="color: #9370db;">Double</span>) <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Double</span>
<span style="color: #00ff7f;">heronA</span> (n,a)
  <span style="color: #9acd32;">|</span> n <span style="color: #9acd32;">&gt;</span> 0     <span style="color: #9acd32;">=</span> (heronA(n<span style="color: #9acd32;">-</span>1,a) <span style="color: #9acd32;">+</span> a<span style="color: #9acd32;">/</span>heronA(n<span style="color: #9acd32;">-</span>1, a))<span style="color: #9acd32;">/</span>2
  <span style="color: #9acd32;">|</span> otherwise <span style="color: #9acd32;">=</span> a

<span style="color: #00ff7f;">absolute</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Int</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Int</span>
<span style="color: #00ff7f;">absolute</span> x <span style="color: #9acd32;">=</span> <span style="color: #20b2aa; font-weight: bold;">if</span> x <span style="color: #9acd32;">&lt;</span> 0 <span style="color: #20b2aa; font-weight: bold;">then</span> <span style="color: #9acd32;">-</span>x <span style="color: #20b2aa; font-weight: bold;">else</span> x

<span style="color: #00ff7f;">heronB</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Int</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Double</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Double</span>
<span style="color: #00ff7f;">heronB</span> n a
  <span style="color: #9acd32;">|</span> n <span style="color: #9acd32;">&gt;</span> 0     <span style="color: #9acd32;">=</span> (heronB (n<span style="color: #9acd32;">-</span>1) a <span style="color: #9acd32;">+</span> a<span style="color: #9acd32;">/</span>heronB(n<span style="color: #9acd32;">-</span>1) a)<span style="color: #9acd32;">/</span>2
  <span style="color: #9acd32;">|</span> otherwise <span style="color: #9acd32;">=</span> a

</pre>
</div>


<p>
where 
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #00ff7f;">heronC</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Int</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Double</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Double</span>
<span style="color: #00ff7f;">heronC</span> n a
  <span style="color: #9acd32;">|</span>n <span style="color: #9acd32;">&gt;</span> 0      <span style="color: #9acd32;">=</span> (x <span style="color: #9acd32;">+</span> a<span style="color: #9acd32;">/</span>x)<span style="color: #9acd32;">/</span>2
  <span style="color: #9acd32;">|</span>otherwise  <span style="color: #9acd32;">=</span> a
  <span style="color: #20b2aa; font-weight: bold;">where</span> x <span style="color: #9acd32;">=</span> heronC (n<span style="color: #9acd32;">-</span>1) a
</pre>
</div>

<p>
fib &amp; where
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #00ff7f;">fibA</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Int</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Int</span>
<span style="color: #00ff7f;">fibA</span> n
  <span style="color: #9acd32;">|</span>n <span style="color: #9acd32;">==</span> 0    <span style="color: #9acd32;">=</span> 0
  <span style="color: #9acd32;">|</span>n <span style="color: #9acd32;">==</span> 1    <span style="color: #9acd32;">=</span> 1
  <span style="color: #9acd32;">|</span>otherwise <span style="color: #9acd32;">=</span> x <span style="color: #9acd32;">+</span>y
  <span style="color: #20b2aa; font-weight: bold;">where</span>
    x <span style="color: #9acd32;">=</span> fibA (n<span style="color: #9acd32;">-</span>1)
    y <span style="color: #9acd32;">=</span> fibA (n<span style="color: #9acd32;">-</span>2)

</pre>
</div>

<p>
fib &amp; where &amp; pattern matching
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #00ff7f;">fibB</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Int</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Int</span>
<span style="color: #00ff7f;">fibB</span> 0 <span style="color: #9acd32;">=</span> 0
<span style="color: #00ff7f;">fibB</span> 1 <span style="color: #9acd32;">=</span> 1
<span style="color: #00ff7f;">fibB</span> n <span style="color: #9acd32;">=</span> fibB (n<span style="color: #9acd32;">-</span>1) <span style="color: #9acd32;">+</span> fibB (n<span style="color: #9acd32;">-</span>2)


<span style="color: #00ff7f;">fibC</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Int</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Int</span>
<span style="color: #00ff7f;">fibC</span> 0 <span style="color: #9acd32;">=</span> 0
<span style="color: #00ff7f;">fibC</span> 1 <span style="color: #9acd32;">=</span> 1
<span style="color: #00ff7f;">fibC</span> n
  <span style="color: #9acd32;">|</span> n <span style="color: #9acd32;">&lt;</span> 0      <span style="color: #9acd32;">=</span> error <span style="color: #ffa07a;">"illegal arguement"</span>
  <span style="color: #9acd32;">|</span> otherwise  <span style="color: #9acd32;">=</span> fibB (n<span style="color: #9acd32;">-</span>1) <span style="color: #9acd32;">+</span> fibB (n<span style="color: #9acd32;">-</span>2)


(<span style="color: #00ff7f;">&lt;##&gt;</span>) <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Int</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Double</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Double</span>
0 <span style="color: #9acd32;">&lt;##&gt;</span> a   <span style="color: #9acd32;">=</span> a
n <span style="color: #00ff7f;">&lt;##&gt;</span> a  
  <span style="color: #9acd32;">|</span> n <span style="color: #9acd32;">&gt;</span> 0  <span style="color: #9acd32;">=</span> (x <span style="color: #9acd32;">+</span> a<span style="color: #9acd32;">/</span>x)<span style="color: #9acd32;">/</span>2
  <span style="color: #9acd32;">|</span> otherwise  <span style="color: #9acd32;">=</span> error <span style="color: #ffa07a;">"illegal arguement"</span>
  <span style="color: #20b2aa; font-weight: bold;">where</span> x <span style="color: #9acd32;">=</span> (n<span style="color: #9acd32;">-</span>1) <span style="color: #9acd32;">&lt;##&gt;</span> a
</pre>
</div>
</div>
</div>

<div id="outline-container-org932d886" class="outline-3">
<h3 id="org932d886">type conversion</h3>
<div class="outline-text-3" id="text-org932d886">
<p>
Guides
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #00ff7f;">vielleichtdreifach</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Bool</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span>
<span style="color: #00ff7f;">vielleichtdreifach</span> verdreifach nochmal n
  <span style="color: #9acd32;">|</span> verdreifach <span style="color: #9acd32;">&amp;&amp;</span> nochmal <span style="color: #9acd32;">=</span> maldrei ( maldrei n)
  <span style="color: #9acd32;">|</span> verdreifach            <span style="color: #9acd32;">=</span> maldrei n
  <span style="color: #9acd32;">|</span> otherwise              <span style="color: #9acd32;">=</span> n
  <span style="color: #20b2aa; font-weight: bold;">where</span> maldrei n <span style="color: #9acd32;">=</span> 3<span style="color: #9acd32;">*</span>n 

<span style="color: #00ff7f;">dreifach</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span>
<span style="color: #00ff7f;">dreifach</span> <span style="color: #9acd32;">=</span> vielleichtdreifach <span style="color: #9370db;">True</span> <span style="color: #9370db;">False</span> 

<span style="color: #00ff7f;">neudreifach</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span>
<span style="color: #00ff7f;">neudreifach</span> <span style="color: #9acd32;">=</span> vielleichtdreifach <span style="color: #9370db;">True</span> <span style="color: #9370db;">True</span>

</pre>
</div>
<p>
vielleichtdreifach Bool Bool -&gt; Integer
</p>
</div>
</div>

<div id="outline-container-org62e0822" class="outline-3">
<h3 id="org62e0822">Factorial</h3>
<div class="outline-text-3" id="text-org62e0822">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #00ff7f;">fac</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span>
<span style="color: #00ff7f;">fac</span> n
  <span style="color: #9acd32;">|</span> n <span style="color: #9acd32;">==</span> 0  <span style="color: #9acd32;">=</span> 1
  <span style="color: #9acd32;">|</span> otherwise <span style="color: #9acd32;">=</span> fac (n<span style="color: #9acd32;">-</span>1) <span style="color: #9acd32;">*</span> n
</pre>
</div>
</div>
</div>

<div id="outline-container-org379c850" class="outline-3">
<h3 id="org379c850">Stern Brocot Floge</h3>
<div class="outline-text-3" id="text-org379c850">
<p>
\(\\s_{0} = 0 \\ s_{1} = 1 \\ s_{2n} = s_{n} \\ s_{2n+1} = s_{n} + s_{n+1}\)
</p>

<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #00ff7f;">*/*</span>) <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span>
(<span style="color: #00ff7f;">*/*</span>) <span style="color: #9acd32;">=</span> div

(<span style="color: #00ff7f;">*%*</span>) <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span>
(<span style="color: #00ff7f;">*%*</span>) <span style="color: #9acd32;">=</span> rem

<span style="color: #00ff7f;">sternBrocot</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span>
<span style="color: #00ff7f;">sternBrocot</span> n
  <span style="color: #9acd32;">|</span> n <span style="color: #9acd32;">==</span> 0      <span style="color: #9acd32;">=</span> 0
  <span style="color: #9acd32;">|</span> n <span style="color: #9acd32;">==</span> 1      <span style="color: #9acd32;">=</span> 1
  <span style="color: #9acd32;">|</span> n <span style="color: #9acd32;">*%*</span> 2 <span style="color: #9acd32;">==</span> 0 <span style="color: #9acd32;">=</span> sternBrocot half
  <span style="color: #9acd32;">|</span> otherwise    <span style="color: #9acd32;">=</span> sternBrocot half <span style="color: #9acd32;">+</span> sternBrocot (half <span style="color: #9acd32;">+</span> 1)
  <span style="color: #20b2aa; font-weight: bold;">where</span> half <span style="color: #9acd32;">=</span> n <span style="color: #9acd32;">*/*</span> 2

<span style="color: #00ff7f;">suche</span> <span style="color: #9acd32;">::</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span> <span style="color: #9acd32;">-&gt;</span> <span style="color: #9370db;">Integer</span>
<span style="color: #00ff7f;">suche</span> suchziel postionziel
  <span style="color: #9acd32;">|</span> sternBrocot postionziel <span style="color: #9acd32;">&gt;</span> suchziel <span style="color: #9acd32;">=</span> postionziel
  <span style="color: #9acd32;">|</span> otherwise                          <span style="color: #9acd32;">=</span> suche suchziel (postionziel <span style="color: #9acd32;">+</span>1)

</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgc2b2ce4" class="outline-2">
<h2 id="orgc2b2ce4">Schaltnetze</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: sx</p>
<p class="date">Created: 2020-05-10 So 21:18</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
